[Norwegian]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Anslut enhetens 2,4 GHz USB-dongle till datorns USB-port för att länka.
Please follow the steps below for pairing. = Följ nedanstående steg för att länka.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Ställ in kopplingsbrytaren på RF 2,4 GHz-läge.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Håll vänster-, höger- och DPI-knappen intryckta i 3 sekunder.
3. Click the "Pair" button on the interface. = 3. Klicka på på knappen ”Länka”  på gränssnittet.	
1. Connect the device to your computer with the USB cable. = 1. Anslut enheten till datorn med USB-kabeln.
2. Click the "Pair" button on the interface. = 2. Klicka på på knappen ”Länka”  på gränssnittet.

Pair = Länka
Close = Stäng
Pairing = Länkar
Pairing completed = Länkad
Pairing failed = Länkningen misslyckades

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Koble enheten til datamaskinen med en USB-kabel og sett tilkoblingsbryteren til 2.4 GHz RF-modus.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Trykk og hold inne funksjonsknappen i 15 sekunder til du hører hørbare meldinger.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Koble fra og sett inn 2,4 GHz RF-mottakeren igjen. Slå av enheten, og sett deretter enheten til 2,4 GHz RF-modus.